<?php
/*Laravel（ララベル）　の特徴
Laravelとは：
フルスタック（システム、サーバー、データベース、ネットワークなどマルチに活躍できる）なPHPフレームワークで、ルーティング（データに対しての道案内）、コントローラ（他の要素を制御し人間が操作や指示を与える役割）、ビュー（見え方や表示の仕方）、ORM（オブジェクトマッピングという。自身でプログラミングをするオブジェクト部分とデータベースの橋渡し的な存在で、ORMを使うことによってソリューションの作成にあたる定型文を減らすことができる）など基本的な機能を備え、さらに近代的なWebアプリで活用されるジョブキュー（キュー（データ構造の一種）に登録したジョブを実行すること）やWebストレージなども積極的に統合している。

MITライセンス（無料のオープンソースソフトウェアライセンスのこと）の下でリリースされており、そのソースコードはGitHubにホスティング（サーバを借りていること）されている。

Laravelの名前は『ナルニア国物語』に登場するナルニア国の王都、ケア・パラベルにちなむ。


人気の背景：
海外で大変普及しているフレームワーク。日本でも利用者が急増しているとのこと。
日本語での説明などは少ないが、癖がなく習得するのにそこまで難易度が高くない。

特徴：
コードが読みやすいし書きやすい
学習コストが低くてすむ
強力なルーティングフィルター（IPアドレス・プロトコル・ポート番号によって同一経路を複数のゲートウェイへ振り分けることができる機能で、これにより複数のプロバイダと同時接続をすることができる）
柔軟なオートローダー（テープ自動交換機能付きバックアップ装置）
簡単なページネーション（1ページの掲載量が多くなった際にページを分割できる機能。これにより、ページ読み込み速度を落とさずにすむ）
ビューをサポートするコンポーサー（phpのパッケージ管理システム。これを使うとライブラリにあてる手間や管理が楽になる。）*/
?>
